chat_system_1763064780_actor_description=Harl - King of Griffins. King of Griffins.
chat_system_1763064780_snap_5_question=^?^Has that madman given you the picture?
chat_system_1763064780_snap_5_answer_0=^?^Of course, he didn't dare to object; you are the king, after all.
chat_system_1763064780_snap_4_question=^?^That's great news! Thank you, [player]!<br>[reward]
chat_system_1763064780_snap_4_answer_0=^?^I'm always glad to help you, Your Majesty!
chat_system_1763064780_snap_3_question=^?^Have you visited the artist?
chat_system_1763064780_snap_3_answer_0=^?^Yes, I have.... And he has dared to ask for additional payment for his picture! He wants another ten thousand gold.
chat_system_1763064780_snap_3_answer_1=^?^Yes, I have. The artist is extremely proud of this work, and considers it to be the best one he has ever created.
chat_system_1763064780_snap_3_answer_2=^?^Yes, I have... I've found out he needs some materials for finishing a portrait, and he asked me to acquire them. This is what I'm doing now.
chat_system_1763064780_snap_3_answer_3=^?^No, I haven't yet.
chat_system_1763064780_snap_6_question=^?^Another ten thousand? He really is a madman! Tell him that Our Majesty cannot allow himself to be run by a shameless artist! I have paid him enough money. Moreover, I've been waiting for the portrait so long that really he must pay me for waiting! So he should honor the terms of our agreement, otherwise he can get himself off of this island.
chat_system_1763064780_snap_6_answer_0=^?^Excellent answer, Your Majesty!
chat_system_1763064780_snap_0_question=^?^Here there lives an artist who asserts that he is the very best. Recently, we decided to immortalize our greatness on the canvas. That is why I commissioned from this artist, a portrait of myself. At once I gave him all the gold he requested, but the portrait remains unready even now. Could you visit him and ask him where our portrait is?<br>[reward]
chat_system_1763064780_snap_0_answer_0=^?^Which artist? And where can I find him?
chat_system_1763064780_snap_1_question=^?^His name is Alex Artist. He lives in the northern part of our island. You should recognize his home at once.
chat_system_1763064780_snap_1_answer_0=^?^Ok, I'll go to the artist.
chat_system_1763064780_snap_1_answer_1=^?^No, unfortunately I have no time. It will be better to send one of your servants.
chat_system_1763064780_snap_2_question=^?^Griffins are afraid to leave their nests. After the recent magic storm, a great many huge spiders found shelter on our island. They get into our nests and destroy the eggs.<br>This is why I ask that you to find the artist, and speak to him about the portrait which I commissioned.
chat_system_1763064780_snap_2_answer_0=^?^Ok, I'll try.
